ph-ubl-dian/src/test/resources/test-ubl/invoice1.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!--

    Copyright (C) 2020-2023 Philip Helger (www.helger.com)
    philip[at]helger[dot]com

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

            http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.

-->
<Invoice xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2"
  xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2"
  xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2"
  xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
  xmlns:ext="urn:oasis:names:specification:ubl:schema:xsd:CommonExtensionComponents-2"
  xmlns:sts="dian:gov:co:facturaelectronica:Structures-2-1" xmlns:xades="http://uri.etsi.org/01903/v1.3.2#"
  xmlns:xades141="http://uri.etsi.org/01903/v1.4.1#" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xsi:schemaLocation="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2     http://docs.oasis-open.org/ubl/os-UBL-2.1/xsd/maindoc/UBL-Invoice-2.1.xsd">
  <cbc:UBLVersionID>UBL 2.1</cbc:UBLVersionID>
  <cbc:CustomizationID>05</cbc:CustomizationID>
  <cbc:ProfileID>DIAN 2.1</cbc:ProfileID>
  <cbc:ProfileExecutionID>2</cbc:ProfileExecutionID>
  <cbc:ID>SETP990000002</cbc:ID>
  <cbc:UUID schemeID="2" schemeName="CUFE-SHA384">941cf36af62dbbc06f105d2a80e9bfe683a90e84960eae4d351cc3afbe8f848c26c39bac4fbc80fa254824c6369ea694</cbc:UUID>
  <cbc:IssueDate>2019-06-20</cbc:IssueDate>
  <cbc:IssueTime>09:15:23-05:00</cbc:IssueTime>
  <cbc:InvoiceTypeCode>01</cbc:InvoiceTypeCode>
  <cbc:Note>SETP9900000022019-06-2009:15:23-05:0012600.06012424.01040.00030.0014024.07900508908900108281fc8eac422eba16e22ffd8c6f94b3f40a6e38162c2</cbc:Note>
  <cbc:DocumentCurrencyCode listAgencyID="6"
    listAgencyName="United Nations Economic Commission for Europe" listID="ISO 4217 Alpha">COP</cbc:DocumentCurrencyCode>
  <cbc:LineCountNumeric>2</cbc:LineCountNumeric>
  <cac:InvoicePeriod>
    <cbc:StartDate>2019-05-01</cbc:StartDate>
    <cbc:EndDate>2019-05-30</cbc:EndDate>
  </cac:InvoicePeriod>
  <cac:BillingReference>
    <cac:InvoiceDocumentReference>
      <cbc:ID>SFR3123856</cbc:ID>
      <cbc:UUID schemeName="CUFE-SHA1">a675432fecc1d537361dcdbdfbd08d6e5283f2bc</cbc:UUID>
      <cbc:IssueDate>2018-09-29</cbc:IssueDate>
      <cbc:DocumentDescription>Prepago recibido</cbc:DocumentDescription>
    </cac:InvoiceDocumentReference>
  </cac:BillingReference>
  <cac:BillingReference>
    <cac:InvoiceDocumentReference>
      <cbc:ID>SETP990000101</cbc:ID>
      <cbc:UUID schemeName="CUFE-SHA384">1dc661228f152332d876e1f1cd2042ecdea1804ed0da78f84dc9ee0938d69f17037dc53f97778ed2721d65c1fc3c73ac</cbc:UUID>
      <cbc:IssueDate>2018-09-29</cbc:IssueDate>
      <cbc:DocumentDescription>Factura anterior</cbc:DocumentDescription>
    </cac:InvoiceDocumentReference>
  </cac:BillingReference>
  <cac:AccountingSupplierParty>
    <cbc:AdditionalAccountID>1</cbc:AdditionalAccountID>
    <cac:Party>
      <cac:PartyName>
        <cbc:Name>Nombre Tienda</cbc:Name>
      </cac:PartyName>
      <cac:PartyName>
        <cbc:Name>Establecimiento Principal</cbc:Name>
      </cac:PartyName>
      <cac:PartyName>
        <cbc:Name>DIAN</cbc:Name>
      </cac:PartyName>
      <cac:PhysicalLocation>
        <cac:Address>
          <cbc:ID>11001</cbc:ID>
          <cbc:CityName>Bogotá, D.c. </cbc:CityName>
          <cbc:CountrySubentity>Bogotá</cbc:CountrySubentity>
          <cbc:CountrySubentityCode>11</cbc:CountrySubentityCode>
          <cac:AddressLine>
            <cbc:Line>Av. #97 - 13</cbc:Line>
          </cac:AddressLine>
          <cac:Country>
            <cbc:IdentificationCode>CO</cbc:IdentificationCode>
            <cbc:Name languageID="es">Colombia</cbc:Name>
          </cac:Country>
        </cac:Address>
      </cac:PhysicalLocation>
      <cac:PartyTaxScheme>
        <cbc:RegistrationName>DIAN</cbc:RegistrationName>
        <cbc:CompanyID schemeAgencyID="195"
          schemeAgencyName="CO, DIAN (Dirección de Impuestos y Aduanas Nacionales)" schemeID="4" schemeName="31">800197268</cbc:CompanyID>
        <cbc:TaxLevelCode listName="05">O-99</cbc:TaxLevelCode>
        <cac:RegistrationAddress>
          <cbc:ID>11001</cbc:ID>
          <cbc:CityName>Bogotá, D.c. </cbc:CityName>
          <cbc:CountrySubentity>Bogotá</cbc:CountrySubentity>
          <cbc:CountrySubentityCode>11</cbc:CountrySubentityCode>
          <cac:AddressLine>
            <cbc:Line>Av. Jiménez #7 - 13</cbc:Line>
          </cac:AddressLine>
          <cac:Country>
            <cbc:IdentificationCode>CO</cbc:IdentificationCode>
            <cbc:Name languageID="es">Colombia</cbc:Name>
          </cac:Country>
        </cac:RegistrationAddress>
        <cac:TaxScheme>
          <cbc:ID>01</cbc:ID>
          <cbc:Name>IVA</cbc:Name>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>DIAN</cbc:RegistrationName>
        <cbc:CompanyID schemeAgencyID="195"
          schemeAgencyName="CO, DIAN (Dirección de Impuestos y Aduanas Nacionales)" schemeID="9" schemeName="31">800197268</cbc:CompanyID>
        <cac:CorporateRegistrationScheme>
          <cbc:ID>SETP</cbc:ID>
          <cbc:Name>10181</cbc:Name>
        </cac:CorporateRegistrationScheme>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>Eric Valencia</cbc:Name>
        <cbc:Telephone>6111111</cbc:Telephone>
        <cbc:ElectronicMail>eric.valencia@ket.co</cbc:ElectronicMail>
        <cbc:Note>Test descripcion contacto</cbc:Note>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingSupplierParty>
  <cac:AccountingCustomerParty>
    <cbc:AdditionalAccountID>1</cbc:AdditionalAccountID>
    <cac:Party>
      <cac:PartyName>
        <cbc:Name>OPTICAS GMO COLOMBIA S A S</cbc:Name>
      </cac:PartyName>
      <cac:PhysicalLocation>
        <cac:Address>
          <cbc:ID>11001</cbc:ID>
          <cbc:CityName>Bogotá, D.c. </cbc:CityName>
          <cbc:CountrySubentity>Bogotá</cbc:CountrySubentity>
          <cbc:CountrySubentityCode>11</cbc:CountrySubentityCode>
          <cac:AddressLine>
            <cbc:Line>CARRERA 8 No 20-14/40</cbc:Line>
          </cac:AddressLine>
          <cac:Country>
            <cbc:IdentificationCode>CO</cbc:IdentificationCode>
            <cbc:Name languageID="es">Colombia</cbc:Name>
          </cac:Country>
        </cac:Address>
      </cac:PhysicalLocation>
      <cac:PartyTaxScheme>
        <cbc:RegistrationName>OPTICAS GMO COLOMBIA S A S</cbc:RegistrationName>
        <cbc:CompanyID schemeAgencyID="195"
          schemeAgencyName="CO, DIAN (Dirección de Impuestos y Aduanas Nacionales)" schemeID="3" schemeName="31">900108281</cbc:CompanyID>
        <cbc:TaxLevelCode listName="04">O-99</cbc:TaxLevelCode>
        <cac:RegistrationAddress>
          <cbc:ID>11001</cbc:ID>
          <cbc:CityName>Bogotá, D.c. </cbc:CityName>
          <cbc:CountrySubentity>Bogotá</cbc:CountrySubentity>
          <cbc:CountrySubentityCode>11</cbc:CountrySubentityCode>
          <cac:AddressLine>
            <cbc:Line>CR 9 A N0 99 - 07 OF 802</cbc:Line>
          </cac:AddressLine>
          <cac:Country>
            <cbc:IdentificationCode>CO</cbc:IdentificationCode>
            <cbc:Name languageID="es">Colombia</cbc:Name>
          </cac:Country>
        </cac:RegistrationAddress>
        <cac:TaxScheme>
          <cbc:ID>01</cbc:ID>
          <cbc:Name>IVA</cbc:Name>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>OPTICAS GMO COLOMBIA S A S</cbc:RegistrationName>
        <cbc:CompanyID schemeAgencyID="195"
          schemeAgencyName="CO, DIAN (Dirección de Impuestos y Aduanas Nacionales)" schemeID="3" schemeName="31">900108281</cbc:CompanyID>
        <cac:CorporateRegistrationScheme>
          <cbc:Name>90518</cbc:Name>
        </cac:CorporateRegistrationScheme>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>Diana Cruz</cbc:Name>
        <cbc:Telephone>31031031089</cbc:Telephone>
        <cbc:ElectronicMail>dcruz@empresa.org</cbc:ElectronicMail>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingCustomerParty>
  <cac:TaxRepresentativeParty>
    <cac:PartyIdentification>
      <cbc:ID schemeAgencyID="195" schemeAgencyName="CO, DIAN (Dirección de Impuestos y Aduanas Nacionales)"
        schemeID="4" schemeName="31">989123123</cbc:ID>
    </cac:PartyIdentification>
  </cac:TaxRepresentativeParty>
  <cac:Delivery>
    <cac:DeliveryAddress>
      <cbc:ID>11001</cbc:ID>
      <cbc:CityName>Bogotá, D.c. </cbc:CityName>
      <cbc:CountrySubentity>Bogotá, D.c. 11</cbc:CountrySubentity>
      <cbc:CountrySubentityCode>11</cbc:CountrySubentityCode>
      <cac:AddressLine>
        <cbc:Line>CARRERA 8 No 20-14/40</cbc:Line>
      </cac:AddressLine>
      <cac:Country>
        <cbc:IdentificationCode>CO</cbc:IdentificationCode>
        <cbc:Name languageID="es">Colombia</cbc:Name>
      </cac:Country>
    </cac:DeliveryAddress>
    <cac:DeliveryParty>
      <cac:PartyName>
        <cbc:Name>Empresa de transporte</cbc:Name>
      </cac:PartyName>
      <cac:PhysicalLocation>
        <cac:Address>
          <cbc:ID>11001</cbc:ID>
          <cbc:CityName>Bogotá, D.c. </cbc:CityName>
          <cbc:CountrySubentity>Bogotá</cbc:CountrySubentity>
          <cbc:CountrySubentityCode>11</cbc:CountrySubentityCode>
          <cac:AddressLine>
            <cbc:Line>Av.  #17 - 193</cbc:Line>
          </cac:AddressLine>
          <cac:Country>
            <cbc:IdentificationCode>CO</cbc:IdentificationCode>
            <cbc:Name languageID="es">Colombia</cbc:Name>
          </cac:Country>
        </cac:Address>
      </cac:PhysicalLocation>
      <cac:PartyTaxScheme>
        <cbc:RegistrationName>Empresa de transporte</cbc:RegistrationName>
        <cbc:CompanyID schemeAgencyID="195"
          schemeAgencyName="CO, DIAN (Dirección de Impuestos y Aduanas Nacionales)" schemeID="1" schemeName="31">981223983</cbc:CompanyID>
        <cbc:TaxLevelCode listName="04">O-99</cbc:TaxLevelCode>
        <cac:TaxScheme>
          <cbc:ID>01</cbc:ID>
          <cbc:Name>IVA</cbc:Name>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>Empresa de transporte</cbc:RegistrationName>
        <cbc:CompanyID schemeAgencyID="195"
          schemeAgencyName="CO, DIAN (Dirección de Impuestos y Aduanas Nacionales)" schemeID="1" schemeName="31">981223983</cbc:CompanyID>
        <cac:CorporateRegistrationScheme>
          <cbc:Name>75433</cbc:Name>
        </cac:CorporateRegistrationScheme>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>Eric Van Boxsom</cbc:Name>
        <cbc:Telephone>9712311</cbc:Telephone>
        <cbc:Telefax>12431241</cbc:Telefax>
        <cbc:ElectronicMail>eric.vanboxsom@gosocket.net</cbc:ElectronicMail>
        <cbc:Note>Test descripcion contacto</cbc:Note>
      </cac:Contact>
    </cac:DeliveryParty>
  </cac:Delivery>
  <cac:DeliveryTerms>
    <cbc:SpecialTerms>Portes Pagados</cbc:SpecialTerms>
    <cbc:LossRiskResponsibilityCode>CFR</cbc:LossRiskResponsibilityCode>
    <cbc:LossRisk>Costo y Flete</cbc:LossRisk>
  </cac:DeliveryTerms>
  <cac:PaymentMeans>
    <cbc:ID>2</cbc:ID>
    <cbc:PaymentMeansCode>41</cbc:PaymentMeansCode>
    <cbc:PaymentDueDate>2019-06-30</cbc:PaymentDueDate>
    <cbc:PaymentID>1234</cbc:PaymentID>
  </cac:PaymentMeans>
  <cac:PrepaidPayment>
    <cbc:ID>SFR3123856</cbc:ID>
    <cbc:PaidAmount currencyID="COP">1000.00</cbc:PaidAmount>
    <cbc:ReceivedDate>2018-09-29</cbc:ReceivedDate>
    <cbc:PaidDate>2018-09-29</cbc:PaidDate>
    <cbc:InstructionID>Prepago recibido</cbc:InstructionID>
  </cac:PrepaidPayment>
  <cac:TaxTotal>
    <cbc:TaxAmount currencyID="COP">2424.01</cbc:TaxAmount>
    <cac:TaxSubtotal>
      <cbc:TaxableAmount currencyID="COP">12600.06</cbc:TaxableAmount>
      <cbc:TaxAmount currencyID="COP">2394.01</cbc:TaxAmount>
      <cac:TaxCategory>
        <cbc:Percent>19.00</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>01</cbc:ID>
          <cbc:Name>IVA</cbc:Name>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:TaxSubtotal>
    <cac:TaxSubtotal>
      <cbc:TaxableAmount currencyID="COP">187.50</cbc:TaxableAmount>
      <cbc:TaxAmount currencyID="COP">30.00</cbc:TaxAmount>
      <cac:TaxCategory>
        <cbc:Percent>16.00</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>01</cbc:ID>
          <cbc:Name>IVA</cbc:Name>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:TaxSubtotal>
  </cac:TaxTotal>
  <cac:TaxTotal>
    <cbc:TaxAmount currencyID="COP">0.00</cbc:TaxAmount>
    <cac:TaxSubtotal>
      <cbc:TaxableAmount currencyID="COP">0.00</cbc:TaxableAmount>
      <cbc:TaxAmount currencyID="COP">0.00</cbc:TaxAmount>
      <cac:TaxCategory>
        <cbc:Percent>0.000</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>03</cbc:ID>
          <cbc:Name>ICA</cbc:Name>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:TaxSubtotal>
  </cac:TaxTotal>
  <cac:TaxTotal>
    <cbc:TaxAmount currencyID="COP">0.00</cbc:TaxAmount>
    <cac:TaxSubtotal>
      <cbc:TaxableAmount currencyID="COP">0.00</cbc:TaxableAmount>
      <cbc:TaxAmount currencyID="COP">0.00</cbc:TaxAmount>
      <cac:TaxCategory>
        <cbc:Percent>0.00</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>04</cbc:ID>
          <cbc:Name>INC</cbc:Name>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:TaxSubtotal>
  </cac:TaxTotal>
  <cac:LegalMonetaryTotal>
    <cbc:LineExtensionAmount currencyID="COP">12600.06</cbc:LineExtensionAmount>
    <cbc:TaxExclusiveAmount currencyID="COP">12787.56</cbc:TaxExclusiveAmount>
    <cbc:TaxInclusiveAmount currencyID="COP">15024.07</cbc:TaxInclusiveAmount>
    <cbc:PrepaidAmount currencyID="COP">1000.00</cbc:PrepaidAmount>
    <cbc:PayableAmount currencyID="COP">14024.07</cbc:PayableAmount>
  </cac:LegalMonetaryTotal>
  <cac:InvoiceLine>
    <cbc:ID>1</cbc:ID>
    <cbc:InvoicedQuantity unitCode="EA">1.000000</cbc:InvoicedQuantity>
    <cbc:LineExtensionAmount currencyID="COP">12600.06</cbc:LineExtensionAmount>
    <cbc:FreeOfChargeIndicator>false</cbc:FreeOfChargeIndicator>
    <cac:Delivery>
      <cac:DeliveryLocation>
        <cbc:ID schemeID="999" schemeName="EAN">613124312412</cbc:ID>
      </cac:DeliveryLocation>
    </cac:Delivery>
    <cac:AllowanceCharge>
      <cbc:ID>1</cbc:ID>
      <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
      <cbc:AllowanceChargeReason>Descuento por cliente frecuente</cbc:AllowanceChargeReason>
      <cbc:MultiplierFactorNumeric>33.33</cbc:MultiplierFactorNumeric>
      <cbc:Amount currencyID="COP">6299.94</cbc:Amount>
      <cbc:BaseAmount currencyID="COP">18900.00</cbc:BaseAmount>
    </cac:AllowanceCharge>
    <cac:TaxTotal>
      <cbc:TaxAmount currencyID="COP">2394.01</cbc:TaxAmount>
      <cac:TaxSubtotal>
        <cbc:TaxableAmount currencyID="COP">12600.06</cbc:TaxableAmount>
        <cbc:TaxAmount currencyID="COP">2394.01</cbc:TaxAmount>
        <cac:TaxCategory>
          <cbc:Percent>19.00</cbc:Percent>
          <cac:TaxScheme>
            <cbc:ID>01</cbc:ID>
            <cbc:Name>IVA</cbc:Name>
          </cac:TaxScheme>
        </cac:TaxCategory>
      </cac:TaxSubtotal>
    </cac:TaxTotal>
    <cac:Item>
      <cbc:Description>AV OASYS -2.25 (8.4) LENTE DE CONTATO</cbc:Description>
      <cac:SellersItemIdentification>
        <cbc:ID>AOHV84-225</cbc:ID>
      </cac:SellersItemIdentification>
      <cac:AdditionalItemIdentification>
        <cbc:ID schemeID="999" schemeName="EAN13">6543542313534</cbc:ID>
      </cac:AdditionalItemIdentification>
    </cac:Item>
    <cac:Price>
      <cbc:PriceAmount currencyID="COP">18900.00</cbc:PriceAmount>
      <cbc:BaseQuantity unitCode="EA">1.000000</cbc:BaseQuantity>
    </cac:Price>
  </cac:InvoiceLine>
  <cac:InvoiceLine>
    <cbc:ID>2</cbc:ID>
    <cbc:InvoicedQuantity unitCode="NIU">1.000000</cbc:InvoicedQuantity>
    <cbc:LineExtensionAmount currencyID="COP">0.00</cbc:LineExtensionAmount>
    <cbc:FreeOfChargeIndicator>true</cbc:FreeOfChargeIndicator>
    <cac:DocumentReference>
      <cbc:ID>TST1543623</cbc:ID>
      <cbc:IssueDate>2019-03-02</cbc:IssueDate>
      <cbc:DocumentTypeCode>1001-A</cbc:DocumentTypeCode>
      <cbc:DocumentType>Bienes Propios</cbc:DocumentType>
    </cac:DocumentReference>
    <cac:DocumentReference>
      <cbc:ID>GR8713461</cbc:ID>
      <cbc:IssueDate>2019-03-02</cbc:IssueDate>
      <cbc:DocumentTypeCode>AR</cbc:DocumentTypeCode>
    </cac:DocumentReference>
    <cac:PricingReference>
      <cac:AlternativeConditionPrice>
        <cbc:PriceAmount currencyID="COP">100.00</cbc:PriceAmount>
        <cbc:PriceTypeCode>03</cbc:PriceTypeCode>
        <cbc:PriceType>Otro valor</cbc:PriceType>
      </cac:AlternativeConditionPrice>
    </cac:PricingReference>
    <cac:Delivery>
      <cac:DeliveryLocation>
        <cbc:ID schemeID="999" schemeName="EAN">613124312412</cbc:ID>
      </cac:DeliveryLocation>
    </cac:Delivery>
    <cac:TaxTotal>
      <cbc:TaxAmount currencyID="COP">30.00</cbc:TaxAmount>
      <cac:TaxSubtotal>
        <cbc:TaxableAmount currencyID="COP">187.50</cbc:TaxableAmount>
        <cbc:TaxAmount currencyID="COP">30.00</cbc:TaxAmount>
        <cac:TaxCategory>
          <cbc:Percent>16.00</cbc:Percent>
          <cac:TaxScheme>
            <cbc:ID>01</cbc:ID>
            <cbc:Name>IVA</cbc:Name>
          </cac:TaxScheme>
        </cac:TaxCategory>
      </cac:TaxSubtotal>
    </cac:TaxTotal>
    <cac:Item>
      <cbc:Description>Bolsa</cbc:Description>
      <cac:SellersItemIdentification>
        <cbc:ID>91412012412</cbc:ID>
      </cac:SellersItemIdentification>
      <cac:StandardItemIdentification>
        <cbc:ID schemeAgencyID="10" schemeID="001" schemeName="UNSPSC">18937100-7</cbc:ID>
      </cac:StandardItemIdentification>
    </cac:Item>
    <cac:Price>
      <cbc:PriceAmount currencyID="COP">0.00</cbc:PriceAmount>
      <cbc:BaseQuantity unitCode="NIU">1.000000</cbc:BaseQuantity>
    </cac:Price>
  </cac:InvoiceLine>
</Invoice>